[
  {
    "role": "Frontend Developer",
    "company": "Salt Indonesia",
    "url": "https://salt.id/",
    "start": "May 2024",
    "end": "Now",
    "description": "SALT is a leading technology consultant in Indonesia committed to empowering businesses within the dynamic technology landscape. Since our establishment in 2013, we have specialized in delivering innovative strategies and technologies that foster business growth and acceleration for our diverse clientele.",
    "responsibilities": [
      "Develop new features",
      "Fix bugs in existing applications",
      "Create global components and publish them to bit.dev",
      "Create an npx command to generate dashboard templates",
      "Write unit tests using Karma and Jasmine"
    ],
    "stacks": [
      "Angular",
      "Typescript",
      "Tailwind CSS",
      "Karma",
      "Jasmine",
      "Clean Architecture"
    ]
  },
  {
    "role": "Frontend Developer",
    "company": "Machine Vision Indonesia",
    "url": "https://machinevision.global/",
    "start": "Feb 2024",
    "end": "Mar 2024",
    "description": "Machine Vision Indonesia helps manufacturers to empower people, process, system, and technology. We helps address human-machine productivity and people development in real-time data to simplify Lean Manufacturing.",
    "responsibilities": [
      "Develop new features on the existing Pelindo IMS project",
      "Fix bugs on the existing Biofarma project",
      "Refactor code"
    ],
    "stacks": [
      "Vue JS",
      "Nuxt JS",
      "React JS",
      "Vuex",
      "Javascript",
      "Typescript",
      "Tailwind CSS",
      "SCSS"
    ]
  },
  {
    "role": "Frontend Developer",
    "company": "Jojonomic (Officeless)",
    "url": "https://officeless.studio/",
    "start": "Feb 2022",
    "end": "Nov 2023",
    "description": "Officeless is an No-Code and Low-Code Platform to build application/system on a single Officeless Studio interface and publish on multiple platform including mobile app (android & IOS) and web application on a single effort.",
    "responsibilities": [
      "Collaborating with Product Teams for developing new features",
      "Maintained existing web app from bug",
      "Create Officeless Drive such as Google Drive from scratch",
      "Revamp UI Application",
      "Initiate Tech Stack for rewrite existing web app",
      "Rewrite web app from Vue JS 2 + Javascript into Vue JS 3 + Typescript (coverage 60%)",
      "Refactor code & Code review"
    ],
    "stacks": [
      "Vue JS",
      "Vite",
      "Pinia",
      "Vuex",
      "Javascript",
      "Typescript",
      "Tailwind CSS",
      "SCSS"
    ]
  },
  {
    "role": "Frontend Developer",
    "company": "Gramedia Asri Media",
    "url": "https://www.gramedia.com/",
    "start": "Feb 2021",
    "end": "Jan 2022",
    "description": "Gramedia.com is the largest and most complete online bookstore in Indonesia which provides a variety of quality books, stationery and other office supplies.",
    "responsibilities": [
      "Maintained and improvement existing web application",
      "Create new application Multiseller Gramedia from scratch",
      "Collaborating with Design, Product and Backend Teams to develop new features",
      "Integration with Algolia to develop search features",
      "Integration with OneKlik BCA to add new payment methods",
      "Integration with Midtrans to provide multiple payment options",
      "Doing code review"
    ],
    "stacks": [
      "Vue JS",
      "Nuxt JS",
      "Vuex",
      "Angular 7",
      "Typescript",
      "SCSS",
      "Less",
      "Bootstrap"
    ]
  },
  {
    "role": "UI Designer & UI Engineer",
    "company": "Mekanika Digital Pratama",
    "url": "",
    "start": "Jul 2019",
    "end": "Nov 2020",
    "description": "Mekanika Digital Pratama is a company that operates in the field of technology services for industry and manufacturing.",
    "responsibilities": [
      "Discuss with clients to get information on client needs",
      "Created user flows, mockups and prototypes for improved design planning and implementation",
      "Slicing UI design and developed into front end web code"
    ],
    "stacks": [
      "Javascript",
      "CSS",
      "Codeigniter",
      "Figma",
      "Corel Draw"
    ]
  }
]